update(readme) pages and added extensive details to sitemap the repo
